package com.example.allclasscompletproject;

import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Color;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.GridView;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import androidx.activity.EdgeToEdge;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.graphics.Insets;
import androidx.core.view.ViewCompat;
import androidx.core.view.WindowInsetsCompat;

import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Random;

public class NewsMainActivity extends AppCompatActivity {
    ListView edList;


HashMap<String,String>hashMap;
    ArrayList<HashMap<String,String>>arrayList=new ArrayList<>();


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        EdgeToEdge.enable(this);
        setContentView(R.layout.activity_news_main);
        edList=findViewById(R.id.edList);




createTable();


        MyAdapter myAdapter=new MyAdapter();
        edList.setAdapter(myAdapter);






        ViewCompat.setOnApplyWindowInsetsListener(findViewById(R.id.main), (v, insets) -> {
            Insets systemBars = insets.getInsets(WindowInsetsCompat.Type.systemBars());
            v.setPadding(systemBars.left, systemBars.top, systemBars.right, systemBars.bottom);
            return insets;
        });
    }

    private class MyAdapter extends BaseAdapter{


        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int i) {
            return null;
        }

        @Override
        public long getItemId(int i) {
            return 0;
        }

        @Override
        public View getView(int position, View view, ViewGroup viewGroup) {
            LayoutInflater layoutInflater= (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);

            View myView=layoutInflater.inflate(R.layout.layout_news,viewGroup,false);


            LinearLayout edLin=myView.findViewById(R.id.edLin);
            ImageView edCover=myView.findViewById(R.id.edCover);
            TextView edCat=myView.findViewById(R.id.edCat);
            TextView edTitle =myView.findViewById(R.id.edTitle);
            TextView edDes =myView.findViewById(R.id.edDes);

            HashMap<String,String>hashMap1=arrayList.get(position);


            String Cat=hashMap1.get("Cat");
            String Title=hashMap1.get("Title");
            String Des=hashMap1.get("Des");
            String Image_url=hashMap1.get("Image_url");


            Picasso.get().load(Image_url)
                    .placeholder(R.drawable.pic1)
                    .into(edCover);

            edCat.setText(Cat);
            edTitle.setText(Title);
            edDes.setText(Des);



            edLin.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View view) {
                    NewsMainActivity2.TITLE=Title;
                    NewsMainActivity2.DESCRIPTION=Des;
                    Bitmap bitmap=((BitmapDrawable)edCover.getDrawable()) .getBitmap();
                    NewsMainActivity2.MY_BITMAP=bitmap;

                    Intent myIntent =new Intent(NewsMainActivity.this,NewsMainActivity2.class);
                    startActivity(myIntent);
                }
            });



            Random rnd = new Random();
            int color = Color.argb(255, rnd.nextInt(256), rnd.nextInt(256), rnd.nextInt(256));
           edCat.setBackgroundColor(color);






            return  myView;

        }
    }


    private void createTable(){




        hashMap=new HashMap<>();
        hashMap.put("Title","সারা দেশে পাওয়া যাচ্ছে ইনফিনিক্সের বাজেট ফোন স্মার্ট ৮ প্রো");
        hashMap.put("Cat","Phone");
        hashMap.put("Des","সম্প্রতি বাংলাদেশের বাজারে এসেছে ইনফিনিক্সের নতুন স্মার্টফোন ‘স্মার্ট ৮ প্রো’। ব্র্যান্ডটির স্মার্ট সিরিজের নতুন সংযোজন এই বাজেট ফোনটি। সাশ্রয়ী মূল্য ও উদ্ভাবনের সমন্বয়ে এটি তরুণদের চাহিদার শীর্ষে রয়েছে।\n" +
                "\n" +
                "ইনফিনিক্স স্মার্ট ৮ প্রো ডিভাইসটিতে আছে ৫০০০ এমএএইচ এর দীর্ঘস্থায়ী ব্যাটারি এবং টাইপ-সি চার্জিং সাপোর্ট। এই ব্যাটারি সাপোর্ট লম্বা সময় ধরে স্বচ্ছন্দ পারফরম্যান্স নিশ্চিত করে। ১০ ওয়াটের ফাস্ট চার্জারের সাহায্যে ডিভাইসটি দ্রুত চার্জ করা যায়, বার বার চার্জ দেওয়ারও প্রয়োজন হয় না। একবার সম্পূর্ণ চার্জে ব্যবহারকারীরা টানা ৩৬ ঘণ্টা পর্যন্ত ভিডিও দেখতে পারবেন। এন্ট্রি-লেভেলের স্মার্টফোন হিসেবে এর ব্যাটারি ব্যাকআপ দুর্দান্ত।\n" +
                "\n" +
                "ব্যবহারকারীদের দুশ্চিন্তা কমাতে এই ডিভাইসে আরও আছে ইনফিনিক্স পাওয়ার ম্যারাথন সমাধান। আল্ট্রা-পাওয়ার-সেভিং মোড ব্যবহার করে মাত্র ৫% চার্জেও অনায়েসেই দুই ঘণ্টা কথা বলা যায়।ইনফিনিক্স স্মার্ট ৮ প্রো- তে রয়েছে উন্নত অক্টা-কোর মিডিয়াটেক হেলিও জি৩৬ চিপসেট। এটি নিরবচ্ছিন্ন মাল্টিটাস্কিং, গেমিং ও স্ট্রিমিং নিশ্চিত করে। ডিভাইসটিতে আছে ৪ জিবি র\u200D্যাম, যা ১৬ জিবি পর্যন্ত বৃদ্ধি করা যায়।\n" +
                "\n" +
                "পছন্দের অ্যাপ, ছবি, ভিডিওসহ নানা কিছু সহজেই সংরক্ষণ করতে এতে আছে ১২৮ জিবি স্টোরেজ। পাশাপাশি মাইক্রোএসডির সাহায্যে এর ধারণক্ষমতা ২ টেরাবাইট পর্যন্ত বাড়ানো যাবে।\n" +
                "\n" +
                "স্মার্ট ৮ প্রো-তে আছে ম্যাজিক রিংযুক্ত ৬.৬ ইঞ্চি এইচডি+ পাঞ্চ-হোল ডিসপ্লে। এই ম্যাজিক রিং-এর মাধ্যমে চার্জিং স্ট্যাটাস এবং অন্যান্য নোটিফিকেশন নির্বিঘ্নে দেখা যায়। ৯০ হার্টজের রিফ্রেশ রেটের কারণে ব্রাউজিংয়ের সময় পাওয়া যাবে না কোনো ল্যাগ; যা ব্যবহারকারীদের স্বচ্ছন্দ টাচের অভিজ্ঞতার নিশ্চিত করবে।\n" +
                "\n" +
                "ডিভাইসটির রিং ফ্ল্যাশলাইটযুক্ত ৫০ মেগাপিক্সেলের ডুয়েল এআই ক্যামেরার সাহায্যে স্বল্প আলোতেও সুন্দর ছবি তোলা যায়। ৮ মেগাপিক্সেলের ফ্রন্ট ক্যামেরার মাধ্যমে ব্যবহারকারীরা সামাজিক যোগাযোগমাধ্যমে শেয়ার করার জন্য চমৎকার সেলফি তুলতে পারবেন।\n" +
                "\n" +
                "তরুণদের পছন্দের কথা মাথায় রেখে ডিজাইন করা হয়েছে ইনফিনিক্স স্মার্ট ৮ প্রো। টিম্বার ব্ল্যাক, শাইনি গোল্ড ও রেইনবো ব্লু এই তিনটি ট্রেন্ডি রঙে পাওয়া যাচ্ছে ফোনটি।\n" +
                "\n" +
                "সারা দেশের ইনফিনিক্স অফিশিয়াল রিটেইল স্টোরে পাওয়া যাচ্ছে ইনফিনিক্স স্মার্ট ৮ প্রো। ফোনটির দাম মাত্র ১১,৪৯৯ টাকা।");
        hashMap.put("Image_url","https://i0.wp.com/techzoom.tv/wp-content/uploads/2024/05/Smart-8-Pro.jpg");
        arrayList.add(hashMap);



        hashMap=new HashMap<>();
        hashMap.put("Title","সারা দেশে পাওয়া যাচ্ছে ইনফিনিক্সের বাজেট ফোন স্মার্ট ৮ প্রো");
        hashMap.put("Cat","Phone");
        hashMap.put("Des","সম্প্রতি বাংলাদেশের বাজারে এসেছে ইনফিনিক্সের নতুন স্মার্টফোন ‘স্মার্ট ৮ প্রো’। ব্র্যান্ডটির স্মার্ট সিরিজের নতুন সংযোজন এই বাজেট ফোনটি। সাশ্রয়ী মূল্য ও উদ্ভাবনের সমন্বয়ে এটি তরুণদের চাহিদার শীর্ষে রয়েছে।\n" +
                "\n" +
                "ইনফিনিক্স স্মার্ট ৮ প্রো ডিভাইসটিতে আছে ৫০০০ এমএএইচ এর দীর্ঘস্থায়ী ব্যাটারি এবং টাইপ-সি চার্জিং সাপোর্ট। এই ব্যাটারি সাপোর্ট লম্বা সময় ধরে স্বচ্ছন্দ পারফরম্যান্স নিশ্চিত করে। ১০ ওয়াটের ফাস্ট চার্জারের সাহায্যে ডিভাইসটি দ্রুত চার্জ করা যায়, বার বার চার্জ দেওয়ারও প্রয়োজন হয় না। একবার সম্পূর্ণ চার্জে ব্যবহারকারীরা টানা ৩৬ ঘণ্টা পর্যন্ত ভিডিও দেখতে পারবেন। এন্ট্রি-লেভেলের স্মার্টফোন হিসেবে এর ব্যাটারি ব্যাকআপ দুর্দান্ত।\n" +
                "\n" +
                "ব্যবহারকারীদের দুশ্চিন্তা কমাতে এই ডিভাইসে আরও আছে ইনফিনিক্স পাওয়ার ম্যারাথন সমাধান। আল্ট্রা-পাওয়ার-সেভিং মোড ব্যবহার করে মাত্র ৫% চার্জেও অনায়েসেই দুই ঘণ্টা কথা বলা যায়।ইনফিনিক্স স্মার্ট ৮ প্রো- তে রয়েছে উন্নত অক্টা-কোর মিডিয়াটেক হেলিও জি৩৬ চিপসেট। এটি নিরবচ্ছিন্ন মাল্টিটাস্কিং, গেমিং ও স্ট্রিমিং নিশ্চিত করে। ডিভাইসটিতে আছে ৪ জিবি র\u200D্যাম, যা ১৬ জিবি পর্যন্ত বৃদ্ধি করা যায়।\n" +
                "\n" +
                "পছন্দের অ্যাপ, ছবি, ভিডিওসহ নানা কিছু সহজেই সংরক্ষণ করতে এতে আছে ১২৮ জিবি স্টোরেজ। পাশাপাশি মাইক্রোএসডির সাহায্যে এর ধারণক্ষমতা ২ টেরাবাইট পর্যন্ত বাড়ানো যাবে।\n" +
                "\n" +
                "স্মার্ট ৮ প্রো-তে আছে ম্যাজিক রিংযুক্ত ৬.৬ ইঞ্চি এইচডি+ পাঞ্চ-হোল ডিসপ্লে। এই ম্যাজিক রিং-এর মাধ্যমে চার্জিং স্ট্যাটাস এবং অন্যান্য নোটিফিকেশন নির্বিঘ্নে দেখা যায়। ৯০ হার্টজের রিফ্রেশ রেটের কারণে ব্রাউজিংয়ের সময় পাওয়া যাবে না কোনো ল্যাগ; যা ব্যবহারকারীদের স্বচ্ছন্দ টাচের অভিজ্ঞতার নিশ্চিত করবে।\n" +
                "\n" +
                "ডিভাইসটির রিং ফ্ল্যাশলাইটযুক্ত ৫০ মেগাপিক্সেলের ডুয়েল এআই ক্যামেরার সাহায্যে স্বল্প আলোতেও সুন্দর ছবি তোলা যায়। ৮ মেগাপিক্সেলের ফ্রন্ট ক্যামেরার মাধ্যমে ব্যবহারকারীরা সামাজিক যোগাযোগমাধ্যমে শেয়ার করার জন্য চমৎকার সেলফি তুলতে পারবেন।\n" +
                "\n" +
                "তরুণদের পছন্দের কথা মাথায় রেখে ডিজাইন করা হয়েছে ইনফিনিক্স স্মার্ট ৮ প্রো। টিম্বার ব্ল্যাক, শাইনি গোল্ড ও রেইনবো ব্লু এই তিনটি ট্রেন্ডি রঙে পাওয়া যাচ্ছে ফোনটি।\n" +
                "\n" +
                "সারা দেশের ইনফিনিক্স অফিশিয়াল রিটেইল স্টোরে পাওয়া যাচ্ছে ইনফিনিক্স স্মার্ট ৮ প্রো। ফোনটির দাম মাত্র ১১,৪৯৯ টাকা।");
        hashMap.put("Image_url","https://i0.wp.com/techzoom.tv/wp-content/uploads/2024/05/Smart-8-Pro.jpg");
        arrayList.add(hashMap);




        hashMap=new HashMap<>();
        hashMap.put("Title","সারা দেশে পাওয়া যাচ্ছে ইনফিনিক্সের বাজেট ফোন স্মার্ট ৮ প্রো");
        hashMap.put("Cat","Phone");
        hashMap.put("Des","সম্প্রতি বাংলাদেশের বাজারে এসেছে ইনফিনিক্সের নতুন স্মার্টফোন ‘স্মার্ট ৮ প্রো’। ব্র্যান্ডটির স্মার্ট সিরিজের নতুন সংযোজন এই বাজেট ফোনটি। সাশ্রয়ী মূল্য ও উদ্ভাবনের সমন্বয়ে এটি তরুণদের চাহিদার শীর্ষে রয়েছে।\n" +
                "\n" +
                "ইনফিনিক্স স্মার্ট ৮ প্রো ডিভাইসটিতে আছে ৫০০০ এমএএইচ এর দীর্ঘস্থায়ী ব্যাটারি এবং টাইপ-সি চার্জিং সাপোর্ট। এই ব্যাটারি সাপোর্ট লম্বা সময় ধরে স্বচ্ছন্দ পারফরম্যান্স নিশ্চিত করে। ১০ ওয়াটের ফাস্ট চার্জারের সাহায্যে ডিভাইসটি দ্রুত চার্জ করা যায়, বার বার চার্জ দেওয়ারও প্রয়োজন হয় না। একবার সম্পূর্ণ চার্জে ব্যবহারকারীরা টানা ৩৬ ঘণ্টা পর্যন্ত ভিডিও দেখতে পারবেন। এন্ট্রি-লেভেলের স্মার্টফোন হিসেবে এর ব্যাটারি ব্যাকআপ দুর্দান্ত।\n" +
                "\n" +
                "ব্যবহারকারীদের দুশ্চিন্তা কমাতে এই ডিভাইসে আরও আছে ইনফিনিক্স পাওয়ার ম্যারাথন সমাধান। আল্ট্রা-পাওয়ার-সেভিং মোড ব্যবহার করে মাত্র ৫% চার্জেও অনায়েসেই দুই ঘণ্টা কথা বলা যায়।ইনফিনিক্স স্মার্ট ৮ প্রো- তে রয়েছে উন্নত অক্টা-কোর মিডিয়াটেক হেলিও জি৩৬ চিপসেট। এটি নিরবচ্ছিন্ন মাল্টিটাস্কিং, গেমিং ও স্ট্রিমিং নিশ্চিত করে। ডিভাইসটিতে আছে ৪ জিবি র\u200D্যাম, যা ১৬ জিবি পর্যন্ত বৃদ্ধি করা যায়।\n" +
                "\n" +
                "পছন্দের অ্যাপ, ছবি, ভিডিওসহ নানা কিছু সহজেই সংরক্ষণ করতে এতে আছে ১২৮ জিবি স্টোরেজ। পাশাপাশি মাইক্রোএসডির সাহায্যে এর ধারণক্ষমতা ২ টেরাবাইট পর্যন্ত বাড়ানো যাবে।\n" +
                "\n" +
                "স্মার্ট ৮ প্রো-তে আছে ম্যাজিক রিংযুক্ত ৬.৬ ইঞ্চি এইচডি+ পাঞ্চ-হোল ডিসপ্লে। এই ম্যাজিক রিং-এর মাধ্যমে চার্জিং স্ট্যাটাস এবং অন্যান্য নোটিফিকেশন নির্বিঘ্নে দেখা যায়। ৯০ হার্টজের রিফ্রেশ রেটের কারণে ব্রাউজিংয়ের সময় পাওয়া যাবে না কোনো ল্যাগ; যা ব্যবহারকারীদের স্বচ্ছন্দ টাচের অভিজ্ঞতার নিশ্চিত করবে।\n" +
                "\n" +
                "ডিভাইসটির রিং ফ্ল্যাশলাইটযুক্ত ৫০ মেগাপিক্সেলের ডুয়েল এআই ক্যামেরার সাহায্যে স্বল্প আলোতেও সুন্দর ছবি তোলা যায়। ৮ মেগাপিক্সেলের ফ্রন্ট ক্যামেরার মাধ্যমে ব্যবহারকারীরা সামাজিক যোগাযোগমাধ্যমে শেয়ার করার জন্য চমৎকার সেলফি তুলতে পারবেন।\n" +
                "\n" +
                "তরুণদের পছন্দের কথা মাথায় রেখে ডিজাইন করা হয়েছে ইনফিনিক্স স্মার্ট ৮ প্রো। টিম্বার ব্ল্যাক, শাইনি গোল্ড ও রেইনবো ব্লু এই তিনটি ট্রেন্ডি রঙে পাওয়া যাচ্ছে ফোনটি।\n" +
                "\n" +
                "সারা দেশের ইনফিনিক্স অফিশিয়াল রিটেইল স্টোরে পাওয়া যাচ্ছে ইনফিনিক্স স্মার্ট ৮ প্রো। ফোনটির দাম মাত্র ১১,৪৯৯ টাকা।");
        hashMap.put("Image_url","https://i0.wp.com/techzoom.tv/wp-content/uploads/2024/05/Smart-8-Pro.jpg");
        arrayList.add(hashMap);


        hashMap=new HashMap<>();
        hashMap.put("Title","সারা দেশে পাওয়া যাচ্ছে ইনফিনিক্সের বাজেট ফোন স্মার্ট ৮ প্রো");
        hashMap.put("Cat","Phone");
        hashMap.put("Des","সম্প্রতি বাংলাদেশের বাজারে এসেছে ইনফিনিক্সের নতুন স্মার্টফোন ‘স্মার্ট ৮ প্রো’। ব্র্যান্ডটির স্মার্ট সিরিজের নতুন সংযোজন এই বাজেট ফোনটি। সাশ্রয়ী মূল্য ও উদ্ভাবনের সমন্বয়ে এটি তরুণদের চাহিদার শীর্ষে রয়েছে।\n" +
                "\n" +
                "ইনফিনিক্স স্মার্ট ৮ প্রো ডিভাইসটিতে আছে ৫০০০ এমএএইচ এর দীর্ঘস্থায়ী ব্যাটারি এবং টাইপ-সি চার্জিং সাপোর্ট। এই ব্যাটারি সাপোর্ট লম্বা সময় ধরে স্বচ্ছন্দ পারফরম্যান্স নিশ্চিত করে। ১০ ওয়াটের ফাস্ট চার্জারের সাহায্যে ডিভাইসটি দ্রুত চার্জ করা যায়, বার বার চার্জ দেওয়ারও প্রয়োজন হয় না। একবার সম্পূর্ণ চার্জে ব্যবহারকারীরা টানা ৩৬ ঘণ্টা পর্যন্ত ভিডিও দেখতে পারবেন। এন্ট্রি-লেভেলের স্মার্টফোন হিসেবে এর ব্যাটারি ব্যাকআপ দুর্দান্ত।\n" +
                "\n" +
                "ব্যবহারকারীদের দুশ্চিন্তা কমাতে এই ডিভাইসে আরও আছে ইনফিনিক্স পাওয়ার ম্যারাথন সমাধান। আল্ট্রা-পাওয়ার-সেভিং মোড ব্যবহার করে মাত্র ৫% চার্জেও অনায়েসেই দুই ঘণ্টা কথা বলা যায়।ইনফিনিক্স স্মার্ট ৮ প্রো- তে রয়েছে উন্নত অক্টা-কোর মিডিয়াটেক হেলিও জি৩৬ চিপসেট। এটি নিরবচ্ছিন্ন মাল্টিটাস্কিং, গেমিং ও স্ট্রিমিং নিশ্চিত করে। ডিভাইসটিতে আছে ৪ জিবি র\u200D্যাম, যা ১৬ জিবি পর্যন্ত বৃদ্ধি করা যায়।\n" +
                "\n" +
                "পছন্দের অ্যাপ, ছবি, ভিডিওসহ নানা কিছু সহজেই সংরক্ষণ করতে এতে আছে ১২৮ জিবি স্টোরেজ। পাশাপাশি মাইক্রোএসডির সাহায্যে এর ধারণক্ষমতা ২ টেরাবাইট পর্যন্ত বাড়ানো যাবে।\n" +
                "\n" +
                "স্মার্ট ৮ প্রো-তে আছে ম্যাজিক রিংযুক্ত ৬.৬ ইঞ্চি এইচডি+ পাঞ্চ-হোল ডিসপ্লে। এই ম্যাজিক রিং-এর মাধ্যমে চার্জিং স্ট্যাটাস এবং অন্যান্য নোটিফিকেশন নির্বিঘ্নে দেখা যায়। ৯০ হার্টজের রিফ্রেশ রেটের কারণে ব্রাউজিংয়ের সময় পাওয়া যাবে না কোনো ল্যাগ; যা ব্যবহারকারীদের স্বচ্ছন্দ টাচের অভিজ্ঞতার নিশ্চিত করবে।\n" +
                "\n" +
                "ডিভাইসটির রিং ফ্ল্যাশলাইটযুক্ত ৫০ মেগাপিক্সেলের ডুয়েল এআই ক্যামেরার সাহায্যে স্বল্প আলোতেও সুন্দর ছবি তোলা যায়। ৮ মেগাপিক্সেলের ফ্রন্ট ক্যামেরার মাধ্যমে ব্যবহারকারীরা সামাজিক যোগাযোগমাধ্যমে শেয়ার করার জন্য চমৎকার সেলফি তুলতে পারবেন।\n" +
                "\n" +
                "তরুণদের পছন্দের কথা মাথায় রেখে ডিজাইন করা হয়েছে ইনফিনিক্স স্মার্ট ৮ প্রো। টিম্বার ব্ল্যাক, শাইনি গোল্ড ও রেইনবো ব্লু এই তিনটি ট্রেন্ডি রঙে পাওয়া যাচ্ছে ফোনটি।\n" +
                "\n" +
                "সারা দেশের ইনফিনিক্স অফিশিয়াল রিটেইল স্টোরে পাওয়া যাচ্ছে ইনফিনিক্স স্মার্ট ৮ প্রো। ফোনটির দাম মাত্র ১১,৪৯৯ টাকা।");
        hashMap.put("Image_url","https://i0.wp.com/techzoom.tv/wp-content/uploads/2024/05/Smart-8-Pro.jpg");
        arrayList.add(hashMap);


      hashMap=new HashMap<>();
      hashMap.put("Title","অপো এ৬০ লাখ টাকা ক্যাম্পেইন’ বিজয়ীর নাম ঘোষণা");
      hashMap.put("Cat","OPPO");
      hashMap.put("Des","অপো এ৬০ স্মার্টফোনের উন্মোচনকে উদযাপন করতে ‘অপো এ৬০ লাখ টাকা ক্যাম্পেইন’- এর ভাগ্যবান বিজয়ীর নাম ঘোষণা করেছে বৈশ্বিক স্মার্টফোন উদ্ভাবনী প্রতিষ্ঠান অপো। গত ০৮ মে, ২০২৪, থেকে ১৪ মে, ২০২৪, পর্যন্ত চলা ফোনটির প্রি-অর্ডার ক্যাম্পেইনে বহু সংখ্যক গ্রাহক অংশ নেয়। বাজারে আসার পর অপো এ৬০ এই সেগমেন্টে সবচেয়ে কাঙ্খিত ডিভাইসগুলোর মধ্যে জায়গা করে নিয়েছে।\n" +
              "\n" +
              "লটারির মাধ্যমে নির্বাচিত করে এই ক্যাম্পেইনের বিজয়ীকে এক লাখ টাকার পুরস্কার প্রদান করা হয়েছে। অপো এ৬০ এর মতো অত্যাধুনিক প্রযুক্তির ফোনটির অভিজ্ঞতা নিতে অত্যন্ত উৎসাহী ছিলেন প্রি-অর্ডার ক্যাম্পেইনে\n" +
              "\n" +
              "অংশগ্রহণকারী স্মার্টফোনপ্রেমীরা। তাদের মধ্য থেকে রাজধানীর ফার্মগেট এলাকার মোহাম্মদ ইউনূস হয়েছেন ভাগ্যবান বিজেতা। পুরস্কার হিসেবে তাকে এক লাখ টাকার চেক দেওয়া হয়।অপো এ৬০ ফোনে রয়েছে বিশেষ ‘স্প্ল্যাশ টাচ’ ফিচার, যা ভেজা হাতে ব্যবহারের সময়ও ফোনের ব্যবহারকারীকে দেয় সঠিক রেসপন্সের নিশ্চয়তা। টাচ আইসি’র সঙ্গে অপো’র সমন্বয়ের মাধ্যমে অপো এ৬০-এর ফিচারটিকে টাচ চিপের সঙ্গে সুন্দরভাবে যুক্ত করা হয়েছে। ফলে বর্ষায় কিংবা অনাকাঙ্ক্ষিত পানির ছিঁটে-ফোঁটা থাকলেও ফোন ব্যবহারকারীরা নিরবচ্ছিন্ন ও মসৃণভাবে ফোনটি ব্যবহার করতে পারবেন।\n" +
              "\n" +
              "নতুন উন্মোচিত অপো এ৬০ ডিভাইসের ১৬জিবি*+২৫৬ জিবি ভ্যারিয়েন্টে রয়েছে ৪৮ মাসের ফ্লুয়েন্সি সার্টিফিকেশন, যা এর পারফরম্যান্সের দীর্ঘস্থায়িত্বের নিশ্চয়তা প্রদান করে। ফোনটির সাবলীল নেভিগেশন এবং অনেক অ্যাপের একসঙ্গে ব্যবহারে সক্ষমতা চার বছরেরও বেশি সময়ের জন্য ব্যবহারকারীদের দেবে ‘নতুন ফোন ব্যবহারের অনুভূতি’।\n" +
              "\n" +
              "অপোপ্রেমীদের জন্য ‘অপো এ৬০ লাখ টাকা ক্যাম্পেইন’ ছিল একটি উৎসবমুখর ক্যাম্পেইন, যেখানে তারা তাদের পছন্দের ফোন বেছে নেওয়ার পাশাপাশি ‘ইন্সপিরেশন অ্যাহেড’ খুঁজতে একটি চমৎকার ক্যাম্পেইনে নিজেদেরকে যুক্ত করতে পেরেছেন।");
      hashMap.put("Image_url","https://i0.wp.com/techzoom.tv/wp-content/uploads/2024/05/%E0%A6%85%E0%A6%AA%E0%A7%8B.png");
      arrayList.add(hashMap);


    }


}